In [4]:
import pymongo
import pandas as pd
import json
from datetime import datetime
client = pymongo.MongoClient("mongodb://root:example@localhost:27017/?authSource=admin&readPreference=primary&ssl=false&directConnection=true")
db = client.Twigram
df = pd.read_csv("C:/Users/Mohib/Desktop/Binance_Socket/shared/Socker.csv")
df2= df.groupby("Open Time")['Values'].apply(lambda x: '|'.join(x)).reset_index()
df2 = df2.sort_values(by=['Open Time'],ascending=False)
data_dict = df2.to_dict("records")
db.Twigram_collection.insert_many(data_dict)

In [26]:
df2

                Open Time                                             Values
0     2019-10-21 08:00:00                   234.44000000-223.79000000-BCHABC
1     2019-10-21 12:00:00                   233.68000000-227.50000000-BCHABC
2     2019-10-21 16:00:00                   234.59000000-228.65000000-BCHABC
3     2019-10-21 20:00:00                   236.19000000-232.34000000-BCHABC
4     2019-10-22 00:00:00                   234.08000000-230.78000000-BCHABC
...                   ...                                                ...
6275  2022-11-30 00:00:00  305.30000000-295.00000000-BNB,17088.41000000-1...
6276  2022-11-30 04:00:00  301.10000000-295.70000000-BNB,16917.50000000-1...
6277  2022-11-30 08:00:00  303.70000000-298.80000000-BNB,16929.11000000-1...
6278  2022-11-30 12:00:00  300.90000000-297.20000000-BNB,16892.58000000-1...
6279  2022-11-30 16:00:00  298.00000000-292.70000000-BNB,16910.52000000-1...

[6280 rows x 2 columns]

In [16]:
import pandas as pd
from io import StringIO

data = StringIO("""
"name1","hej","2014-11-01"
"name1","du","2014-11-02"
"name1","aj","2014-12-01"
"name1","oj","2014-12-02"
"name2","fin","2014-11-01"
"name2","katt","2014-11-02"
"name2","mycket","2014-12-01"
"name2","lite","2014-12-01"
""")
df = pd.read_csv(data,header=0, names=["name","text","date"],parse_dates=[2])

df["month"] = df["date"].apply(lambda x: x.month)
df.groupby(['name'])['text'].apply(lambda x: ','.join(x)).reset_index()

    name                  text
0  name1              du,aj,oj
1  name2  fin,katt,mycket,lite

In [17]:
df

    name    text       date  month
0  name1      du 2014-11-02     11
1  name1      aj 2014-12-01     12
2  name1      oj 2014-12-02     12
3  name2     fin 2014-11-01     11
4  name2    katt 2014-11-02     11
5  name2  mycket 2014-12-01     12
6  name2    lite 2014-12-01     12